In [ ]:
## \#30: Akses nilai variabel pada `query()`

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

In [3]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0  18  10  14  10  18
1  16   8  14  18  19
2  13   9   5  12  18
3   2   2  10   9  15
4  11   6   5   1   8

In [ ]:
### Akses nilai variabel pada `query()`

In [5]:
df.query('A > 10')

    A   B   C   D   E
0  18  10  14  10  18
1  16   8  14  18  19
2  13   9   5  12  18
4  11   6   5   1   8

In [7]:
rerata = df['A'].mean()
rerata

12.0

In [9]:
df.query('A > @rerata')

    A   B   C   D   E
0  18  10  14  10  18
1  16   8  14  18  19
2  13   9   5  12  18